###############################################################
#  Generated by:      Cadence Innovus 15.20-p005_1
#  OS:                Linux x86_64(Host ID IC)
#  Generated on:      Fri Aug 26 06:10:52 2022
#  Design:            Design_Top
#  Command:           saveDesign Design_Top_CTS
###############################################################
current_design Design_Top
create_clock [get_ports {REF_CLK}]  -name CLK1 -period 20.000000 -waveform {0.000000 10.000000}
create_clock [get_ports {UART_CLK}]  -name CLK2 -period 1085.000000 -waveform {0.000000 542.000000}
create_clock [get_ports {scan_clk}]  -name SCAN_CLK -period 100.000000 -waveform {0.000000 50.000000}
create_generated_clock -name GATED_CLOCK -source [get_ports {REF_CLK}] -divide_by 1 -master_clock [get_clocks {CLK1}] -add [get_pins {u_Clock_Gating/Gated_clk}]
create_generated_clock -name DIV_CLOCK -source [get_ports {UART_CLK}] -divide_by 8 -master_clock [get_clocks {CLK2}] -add [get_pins {u_Clock_Divider/o_div_clk}]
set_propagated_clock  [get_pins {u_Clock_Gating/Gated_clk}]
set_propagated_clock  [get_ports {UART_CLK}]
set_propagated_clock  [get_pins {u_Clock_Divider/o_div_clk}]
set_propagated_clock  [get_ports {REF_CLK}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y [get_ports {RX_IN}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y [get_ports {RX_IN}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y [get_ports {RX_IN}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y [get_ports {RX_IN}]
set_load -pin_load -max  0.5  [get_ports {TX_OUT}]
set_load -pin_load -min  0.5  [get_ports {TX_OUT}]
set_case_analysis 0 [get_ports {SE}]
set_case_analysis 0 [get_ports {test_mode}]
set_input_delay -add_delay 217 -clock [get_clocks {CLK2}] [get_ports {RX_IN}]
set_output_delay -add_delay 27 -clock [get_clocks {DIV_CLOCK}] [get_ports {TX_OUT}]
set_clock_uncertainty 0.1 -hold [get_clocks {CLK2}]
set_clock_uncertainty 0.2 -setup [get_clocks {CLK2}]
set_clock_uncertainty 0.1 -hold [get_clocks {SCAN_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {SCAN_CLK}]
set_clock_uncertainty 0.1 -hold [get_clocks {CLK1}]
set_clock_uncertainty 0.2 -setup [get_clocks {CLK1}]
set_clock_groups -name CLK1_1 -asynchronous  -group  [get_clocks {GATED_CLOCK CLK1}] -group  [get_clocks {SCAN_CLK}] -group  [get_clocks {DIV_CLOCK CLK2}]
